// example_sq
/*
2017年银行存款利率如下：
1年期定期存款利率： 1.5%
2年期定期存款利率： 2.1%
3年期定期存款利率： 2.75%
5年期定期存款利率： 3%
活期存款(一季度结算一次)利率：0.35% 

年利率r 存款期n 本金N 
1年期本息： p = N * (1+r)
n年期本息： p = N * (1+ n*r)
n次1年期本息：p = N * pow((1+r),n)
活期本息：  p = N * pow((1+r/4),4*n)
*/
#include <stdio.h>
#include <math.h>
int main()
{
	float N = 1000,r0,r1,r2,r3,r5,p0,p1,p2,p3,p5;
	r0 = 0.0035;
	r1 = 0.015;
	r2 = 0.021;
	r3 = 0.0275;
	r5 = 0.03;
	
	p0 = N*pow((1+r0/4),4*5);	// 活期存款，一季度结算一次 
	p1 = N*pow(1+r1,5);			// 1年期，连续存5年 
	p2 = N*(1+2*r2)*(1+3*r3);	// 先存2年，再存3年 
	p3 = N*(1+3*r3)*(1+2*r2);	// 先存3年，再存2年
	p5 = N*(1+r5*5);			//一次存5年 
	printf("p0=%.2f\np1=%.2f\np2=%.2f\np3=%.2f\np5=%.2f\n",p0,p1,p2,p3,p5);
	return 0;
}
